``` Origin story of Pandas ``` :
1. in 2008 , the pandas development team was created by Wes McKinney and the other members of the Data Wrangling for Python (PyData) community.
2. The first version of pandas was released in 2009.

``` Pandas ``` : 
pandas is a Python library that is used for analyzing and manipulating data. It is known for its data structures and data analysis tools.

``` Use Cases ``` :
1. Data Cleaning
2. Data Analysis
3. Data Transformation
4. Data Visualization (Basic level)
5. Data Aggregation
6. File Handling
7. Data Filtering and Selection
8. Time Series Analysis

``` Series ```:
A series is a one dimensional labeled array that can hold any data type (integer, string, float, python objects, etc.). The axis labels are collectively called the index.

In [1]:
## multiple ways to create a Series.
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c','d']
my_list = [10,20,30,40]
arr = np.array([10,20,30,40])
d = {'d':10,'b':20,'e':30,'d':40}

In [3]:
pd.Series(my_list)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int32

In [6]:
pd.Series(d)

d    40
b    20
e    30
dtype: int64

``` Data Frames ```:        
A DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a database table, or a series of related arrays.

In [7]:
data = {
    "Name " : ["Ajay","Binod","Chotu","Dhruv"],
    "Age" : [28,34,29,42],
    "City" : ["Delhi","Mumbai","Pune","Chennai"],
    "Salary" : [61000,42000,30000,40000],
}

In [8]:
df=pd.DataFrame(data)
df

   Name   Age     City  Salary
0   Ajay   28    Delhi   61000
1  Binod   34   Mumbai   42000
2  Chotu   29     Pune   30000
3  Dhruv   42  Chennai   40000

In [9]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
df2

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [10]:
columns = ['Name','Age','City','Salary']
df3 = pd.DataFrame(data_list,columns=columns)
df3

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [11]:
df3['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [12]:
## to slice multiple columns
df3[['Name','Salary']]

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

In [13]:
## to add new column
df3['Designation']= ['Manager','Clerk','Engineer','Doctor']
df3

    Name  Age      City  Salary Designation
0   John   28  New York   65000     Manager
1   Anna   34     Paris   70000       Clerk
2  Peter   29    Berlin   62000    Engineer
3  Linda   42    London   85000      Doctor

In [14]:
## to remove a column
df3.drop('Designation',axis=1)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [15]:
## to permanently remove a column
df3.drop('Designation',axis=1,inplace=True)
df3

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [16]:
## to selecting a row
df3.loc[0] ## loc means location

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [17]:
## iloc  means index location
df3.iloc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [18]:
## subset of rows
df3.iloc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [19]:
## subset of columns
df3[['Name','Age']]

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [20]:
## subset of rowns and columns
df3.loc[[0,1],['Name','Age']]

   Name  Age
0  John   28
1  Anna   34

In [21]:
df3.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   29
3  Linda   42

In [22]:
## Conditional Selection
df3

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [23]:
df3[df3['Age']>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [24]:
df3[(df3['Age']>30) & (df3['City'] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000

``` Missing Data ``` :

In [25]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [26]:
df.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [27]:
df.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [28]:
## to check which columns have null values
df.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

In [29]:
## to remove null values 
## it work on row basis
df.dropna() ## this will drop all rows beacuse all rows have null values

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [30]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)
df
df.dropna() ## herre one row doesn't have null values so it remain and other got remove

     A  B    C    D
0  1.0  1  1.0  1.0

In [31]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [32]:
df.dropna(thresh = 3) 
## thresh is used for conditional statement 
## here thresh =3 means row must contain 3 non-null values to not get remove

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [33]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [34]:
## to fill missing alues
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [35]:
## to fill null values different for every column
values = {'A':100 ,'B':200 ,'C': 300,'D': 400}
df.fillna(values)

       A  B      C      D
0    1.0  1    1.0    1.0
1    2.0  2    2.0  400.0
2  100.0  3    3.0  400.0
3    4.0  4  300.0  400.0
4    5.0  5  300.0    5.0

In [36]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [37]:
## to fill df with mean
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

``` Merging , Joining and Concatination``` :

In [38]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [39]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [40]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [41]:
## to merge
pd.merge(employees,salaries)

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [42]:
## to merge on the basis of common column
pd.merge(employees,salaries,on = 'employee_id')

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [43]:
## to merge on the basis of inner common parts (means common parts only in both dfs)
pd.merge(employees,salaries,on = 'employee_id', how= 'inner')

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [44]:
## on outer basis ( means it will combine all columns)
pd.merge(employees,salaries,on = 'employee_id',how = 'outer')

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [45]:
pd.merge(employees,salaries,on = 'employee_id',how = 'left')

## here merging is based on left data means employees datafrme so there 
# only data that is present on left side and common with other side

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [46]:
pd.merge(employees,salaries,on = 'employee_id',how = 'right')
## here it is done on salaries basis.
## means data present on right side and common with left side will get completely filled and 
## uncommon will get nan values.

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

In [47]:
## Concatination 

df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [48]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [49]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [50]:
pd.concat([df1,df2]) ## merging of two dfs on the basis of columns basis

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [51]:
## on the rows basis
pd.concat([df1,df2],axis = 1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [52]:
## Joining two dfs
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [53]:
df1

      name
1    Alice
2      Bob
3  Charlie

In [54]:
df2

   score
2     85
3     90
4     75

In [55]:
df1.join(df2)

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0

In [56]:
df2.join(df1)

   score     name
2     85      Bob
3     90  Charlie
4     75      NaN

In [57]:
df2.join(df1,how='outer')

   score     name
1    NaN    Alice
2   85.0      Bob
3   90.0  Charlie
4   75.0      NaN

``` Group By Aggregation ``` :

In [59]:

data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [61]:
## group by category and calculate sum of sales
df.groupby('Category')['Sales'].sum()

Category
A    570
B    930
Name: Sales, dtype: int64

In [62]:
## Group by store and calculate sum of sales
df.groupby('Store')['Sales'].sum()

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [64]:
## group by multiple columns
## group by category and store
df.groupby(['Category', 'Store'])['Sales'].sum()

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

In [65]:
## Aggregation
df['Sales'].mean()

187.5

In [ ]:
df['Sales'].median()
### more are min,max,count,std,etc.

190.0

In [67]:
df['Sales'].agg(['mean', 'median', 'std'])

mean      187.500000
median    190.000000
std        66.062741
Name: Sales, dtype: float64

``` pivot Table ``` :

In [69]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)
df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    421     57   John  January      Q1
1  2023-01-02       B   West    919     84   Mary  January      Q1
2  2023-01-03       C  North    624     32    Bob  January      Q1
3  2023-01-04       D  South    266     45  Alice  January      Q1
4  2023-01-05       A   East    328     68   John  January      Q1
5  2023-01-06       B   West    252     50   Mary  January      Q1
6  2023-01-07       C  North    113     21    Bob  January      Q1
7  2023-01-08       D  South    896     75  Alice  January      Q1
8  2023-01-09       A   East    661     50   John  January      Q1
9  2023-01-10       B   West    676     76   Mary  January      Q1
10 2023-01-11       C  North    658     77    Bob  January      Q1
11 2023-01-12       D  South    221     21  Alice  January      Q1
12 2023-01-13       A   East    975     66   John  January      Q1
13 2023-01-14       B   West    892     80   Mary  January      Q1
14 2023-01-15       C  North    173     35    Bob  January      Q1
15 2023-01-16       D  South    217     88  Alice  January      Q1
16 2023-01-17       A   East    643     40   John  January      Q1
17 2023-01-18       B   West    544     36   Mary  January      Q1
18 2023-01-19       C  North    525     37    Bob  January      Q1
19 2023-01-20       D  South    965     22  Alice  January      Q1

In [72]:
pd.pivot_table(df,values = "Sales",index = 'Region',columns="Product",aggfunc = 'median')
## if we don't provide aggregate func. it will give mean

Product      A      B      C      D
Region
East     643.0    NaN    NaN    NaN
North      NaN    NaN  525.0    NaN
South      NaN    NaN    NaN  266.0
West       NaN  676.0    NaN    NaN

In [71]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     605.6    NaN    NaN    NaN  56.2   NaN   NaN   NaN
North      NaN    NaN  418.6    NaN   NaN   NaN  40.4   NaN
South      NaN    NaN    NaN  513.0   NaN   NaN   NaN  50.2
West       NaN  656.6    NaN    NaN   NaN  65.2   NaN   NaN

In [73]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

``` Operations ``` :

In [74]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [75]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [76]:
df1.shape

(5, 3)

In [77]:
df.columns

Index(['Date', 'Product', 'Region', 'Sales', 'Units', 'Rep', 'Month',
       'Quarter'],
      dtype='object')

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     20 non-null     datetime64[ns]
 1   Product  20 non-null     object
 2   Region   20 non-null     object
 3   Sales    20 non-null     int32
 4   Units    20 non-null     int32
 5   Rep      20 non-null     object
 6   Month    20 non-null     object
 7   Quarter  20 non-null     object
dtypes: datetime64[ns](1), int32(2), object(5)
memory usage: 1.2+ KB

In [79]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [80]:
df1['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [81]:
## applying functions on dataframe
df1['D']=df1['A'].apply(lambda x:x**2)

In [82]:
df1

   A   B    C   D
0  1  10  100   1
1  2  20  200   4
2  3  30  300   9
3  4  40  400  16
4  5  50  500  25